# brew tap
tap "caskroom/cask"
tap "buo/cask-upgrade"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "pivotal/tap"
tap "caskroom/fonts"

# brew install
brew "git"
brew "mas"
brew "wget"
brew "yarn"
brew "neovim"
brew "mysql"
brew "node"
brew "n"
brew "zsh"
brew "python3"

# brew cask install
cask "iterm2"
# cask "postman"
cask "visual-studio-code"
cask "pycharm"
cask "zeplin"
cask "gitkraken"
cask "docker"
cask "tableplus"
cask "appcleaner"
cask "notion"
cask "google-chrome"
cask "keka"
cask "iina"
cask "caprine"
cask "typora"
cask "adobe-creative-cloud"
cask "spotify"

# mas install
mas "Magnet", id: 441258766
mas "KakaoTalk", id: 869223134
mas "Hotspot Shield", id: 771076721
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Hancom Office HWP 2014 VP Viewer", id: 416746898
mas "Spark", id: 1176895641
